publish/deploy-static-file-to-server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 Thu 00:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>部署前端静态文件的简单步骤</title>
<meta name="author" content="Spike Leung" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/theindex.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">部署前端静态文件的简单步骤</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5640838">打包构建</a></li>
<li><a href="#org32c9e15">tar 打包</a>
<ul>
<li><a href="#org1fae5d9">压缩</a></li>
</ul>
</li>
<li><a href="#orgd78e24a">scp 上传 tar 包</a></li>
<li><a href="#orgc90bcfc">ssh 到目标机器</a>
<ul>
<li><a href="#orgd9bb300">避免重复输入密码</a></li>
<li><a href="#orgfd70014">移除过期的指纹</a></li>
</ul>
</li>
<li><a href="#org46acb73">解压 tar 包</a></li>
<li><a href="#org91ea90d">节省手动操作</a></li>
<li><a href="#org1c19f78">进一步节省操作</a></li>
<li><a href="#orge5fc8fd">参考链接</a></li>
</ul>
</div>
</div>
<p>
前端项目开发完成后构建静态文件，之后一般要部署到服务器上。
</p>

<p>
例如 Nginx， 本文将介绍从构建到部署过程中的步骤，
</p>

<p>
涉及到的一些命令 如 <code>tar</code> ， <code>ssh</code> ， <code>scp</code> ， 以及笔者的一些小技巧。
</p>
<div id="outline-container-org5640838" class="outline-2">
<h2 id="org5640838">打包构建</h2>
<div class="outline-text-2" id="text-org5640838">
<p>
执行你项目中的打包命令进行打包即可，也许是 <code>yarn build</code> ， 也许是 <code>npm run build</code> 。
</p>

<p>
具体可以看 <code>package.json</code> 中 <code>scripts</code> 中的定义。
</p>

<p>
如果没有定义，则翻阅文档找找构建工具的构建命令即可，例如这是 <a href="https://cn.vitejs.dev/guide/static-deploy.html">Vite的构建部署文档</a>。
</p>

<p>
在构建前需要注意的：
</p>

<ul class="org-ul">
<li>最好执行 <code>yarn</code> / <code>npm install</code> 安装当前 <code>package.json</code> 中指定的最新依赖，避免其他同事更新了依赖，但本地还没更新的问题</li>
<li>也许你需要打上一个版本号，方便跟踪当前的版本。(关于版本号定义，可以参考 <a href="https://semver.org/lang/zh-CN/">语义化版本 </a>)</li>
<li>也许你还需要设置一些部署时的环境变量或配置</li>
<li>&#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org32c9e15" class="outline-2">
<h2 id="org32c9e15">tar 打包</h2>
<div class="outline-text-2" id="text-org32c9e15">
<p>
当执行完构建后，在某个目录下，会生成若干的静态文件。
</p>

<p>
把静态文件上传到服务器上对应的目录，即可以通过服务器访问构建好的静态文件了。
</p>

<p>
在上传时，如果一个一个文件上传，会有些麻烦， 我们可以将这些静态文件打包成一个 tar 包一次性上传。
</p>
</div>
<div id="outline-container-org1fae5d9" class="outline-3">
<h3 id="org1fae5d9">压缩</h3>
<div class="outline-text-3" id="text-org1fae5d9">
<p>
进入到静态文件所在的目录
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">cd</span> path/to/dist
</pre>
</div>

<p>
将静态文件压缩为一个 tar 包
</p>

<div class="org-src-container">
<pre class="src src-bash">tar -zcvf build_1.0.tar.gz *
</pre>
</div>

<p>
参数解释：
</p>
<ul class="org-ul">
<li><code>-c</code> 表示创建，等同于 <code>--create</code></li>
<li><code>-v</code> 显示打包时的详细输出</li>
<li><code>-z</code> 使用 Gzip 对打包文件进行压缩</li>
<li><code>-f</code> 指定打包后的文件名</li>
<li><code>*</code> 表示打包当前目录下的所有文件，你也可以指定一个一个的文件进行打包</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd78e24a" class="outline-2">
<h2 id="orgd78e24a">scp 上传 tar 包</h2>
<div class="outline-text-2" id="text-orgd78e24a">
<p>
打包完之后，需要把 tar 包上传到服务器，可以使用 <code>scp</code> 命令。
</p>

<p>
假设要上传到 <code>1.1.1.1</code> 上的 <code>/home</code> 目录， 使用 <code>1.1.1.1</code> 的 <code>root</code> 用户，可以执行如下命令：
</p>

<div class="org-src-container">
<pre class="src src-nil">scp path/to/tar root@1.1.1.1:/home
</pre>
</div>

<p>
命令解释：
</p>
<ul class="org-ul">
<li>命令格式: <code>scp source copy</code> 从 <code>source</code> 传到 <code>copy</code></li>
<li><code>path/to/tar</code> tar 包所在的路径</li>
<li><code>root@1.1.1.1:/home</code> 要上传的位置
<ul class="org-ul">
<li><code>root@1.1.1.1</code> 使用 <code>root</code> 登录 <code>1.1.1.1</code> ，进行连接</li>
<li><code>:</code> 分隔目标机器和目录</li>
<li><code>/home</code> 上传到机器上的目录</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc90bcfc" class="outline-2">
<h2 id="orgc90bcfc">ssh 到目标机器</h2>
<div class="outline-text-2" id="text-orgc90bcfc">
<p>
要解压目标机器上的 tar 包，先要连接到目标机器，可以使用 <code>ssh</code> 命令。
</p>

<div class="org-src-container">
<pre class="src src-bash">ssh root@1.1.1.1
The authenticity of host <span style="color: #3548cf;">'1.1.1.1 (1.1.1.1)'</span> can<span style="color: #3548cf;">'t be established.</span>
<span style="color: #3548cf;">nECDSA key fingerprint is SHA256:2CDXn8/+GTFrUT7ayu0BRrKAVShN7P13wO0bSJdSAW4.</span>
<span style="color: #3548cf;">Are you sure you want to continue connecting (yes/no/[fingerprint])?</span>
</pre>
</div>

<p>
命令解释:
</p>

<ul class="org-ul">
<li>使用 <code>root</code> 用户通过 <code>ssh</code> 连接 <code>1.1.1.1</code> 的机器</li>
<li>这里需要确认服务器的指纹，输入 <code>yes</code> 就好了 (不过出于安全考虑，你也可以验证一下这个指纹对不对，确定是你要连接的目标机器)
<ul class="org-ul">
<li>这里是因为机器之前没连接过，要把目标机器的公钥存储到下来， 用来下次识别目标机器</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgd9bb300" class="outline-3">
<h3 id="orgd9bb300">避免重复输入密码</h3>
<div class="outline-text-3" id="text-orgd9bb300">
<p>
每次使用 <code>ssh</code> 命令，都要重新输入一次密码，着实麻烦，通过把 <code>ssh</code> 密钥存到服务器上，可以避免每次连接时输入密码。
</p>

<p>
生成密钥
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt; ssh-keygen

Generating public/private rsa key pair.
Enter file<span style="color: #531ab6;"> in</span> which to save the key <span style="color: #000000;">(</span>path/to/.ssh/id_rsa<span style="color: #000000;">)</span>:
...
</pre>
</div>

<p>
执行完成后，在你指定的路径，如 <code>path/to/.ssh/id_rsa</code> 中，会生成一个密钥，接下来把密钥复制到服务器上，那服务器就认识
我们的机器，就不需要重复输入密码了。
</p>

<p>
上传密钥到服务器，让服务器存储起来:
</p>

<div class="org-src-container">
<pre class="src src-bash">ssh-copy-id -i path/to/.ssh/id_rsa.pub root@1.1.1.1
</pre>
</div>

<p>
参数解释：
</p>
<ul class="org-ul">
<li><code>-i</code> 指定密钥文件，注意，这里的密钥文件对应的是公钥 ，以 <code>.pub</code> 结尾的密钥文件</li>
<li><code>path/to/.ssh/id_rsa.pub</code> 传给服务器的公钥</li>
<li><code>root@1.1.1.1</code> 要上传的目标机器</li>
</ul>


<p>
第一次执行，还需要输入一次命令，后面就不用啦。
</p>
</div>
</div>
<div id="outline-container-orgfd70014" class="outline-3">
<h3 id="orgfd70014">移除过期的指纹</h3>
<div class="outline-text-3" id="text-orgfd70014">
<p>
前面使用 <code>ssh</code> 连接的时候， 需要确认 <code>fingerprint</code> ，一般会被保存在  <code>~/.ssh/known_host</code> 文件下。
</p>

<p>
（笔者是 Mac 系统，不同系统存放位置可能有差异。）
</p>

<p>
有时，目标机器可能重装了，或者目标机器的公钥发生了变化，存储在 <code>~/.ssh/known_host</code> 的目标机器的公钥就失效了。
</p>

<p>
解决办法就是打开 <code>~/.ssh/known_host</code> ，删除掉对应机器的公钥，重新用 <code>ssh</code> 连接机器，存储一个新的公钥就好了。
</p>
</div>
</div>
</div>
<div id="outline-container-org46acb73" class="outline-2">
<h2 id="org46acb73">解压 tar 包</h2>
<div class="outline-text-2" id="text-org46acb73">
<p>
当上传到服务器上后，需要把静态文件从 tar 包中解压出来，你需要把文件解压到服务器指定的目录下，具体要看你服务器如何配置的。
</p>

<p>
假设你使用的是 Nginx， 查看 Nginx 配置， 可以知道要把 tar 包解压到什么目录。
</p>

<div class="org-src-container">
<pre class="src src-bash">...

server <span style="color: #000000;">{</span>
    listen       9999;
    server_name  localhost;

    <span style="color: #595959;">#</span><span style="color: #595959;">charset koi8-r;</span>

    <span style="color: #595959;">#</span><span style="color: #595959;">access_log  logs/host.access.log  main;</span>

    location / <span style="color: #dd22dd;">{</span>
        <span style="color: #595959;"># </span><span style="color: #595959;">&#36825;&#37324;&#25351;&#23450;&#20102;&#38745;&#24577;&#25991;&#20214;&#25152;&#22312;&#30340;&#25991;&#20214;&#36335;&#24452;</span>
        root /home/hello-world;
        index index.html index.htm;
        try_files $<span style="color: #005e8b;">uri</span> $<span style="color: #005e8b;">uri</span>/ /index.html;
    <span style="color: #dd22dd;">}</span>

    <span style="color: #595959;">#</span><span style="color: #595959;">error_page  404              /404.html;</span>

    <span style="color: #595959;"># </span><span style="color: #595959;">redirect server error pages to the static page /50x.html</span>
    <span style="color: #595959;">#</span>
    error_page   500 502 503 504  /50x.html;
    <span style="color: #005e8b;">location</span> = /50x.html <span style="color: #dd22dd;">{</span>
        root   html;
    <span style="color: #dd22dd;">}</span>

    ...
</pre>
</div>

<p>
进入到对应的目录
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075;">cd</span> path/to/static_file_folder
</pre>
</div>

<p>
执行解压命令
</p>

<div class="org-src-container">
<pre class="src src-bash">tar -xvf build.1.0.tar.gz
</pre>
</div>

<p>
参数解释：
</p>
<ul class="org-ul">
<li><code>-x</code> 将 tar 包内容解压，等同于 <code>--extract</code></li>
</ul>


<p>
至此，静态文件的上传已经完成，你应该能够通过服务器访问到这些静态文件了。
</p>
</div>
</div>
<div id="outline-container-org91ea90d" class="outline-2">
<h2 id="org91ea90d">节省手动操作</h2>
<div class="outline-text-2" id="text-org91ea90d">
<p>
上面那么多的步骤，每次都要部署都操作一次，也是有些麻烦，那能不能节省这些操作，一步完成呢？
</p>

<p>
结合 Bash 脚本，把上面的命令组合一下，就可以实现了。
</p>

<p>
如将以下脚本保存为 <code>tar.sh</code> ， 只要执行 <code>./tar.sh</code> 即可完成打包部署的步骤。
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #595959;">#</span><span style="color: #595959;">!/usr/bin/</span><span style="color: #531ab6;">env</span><span style="color: #595959;"> sh</span>

<span style="color: #595959;"># </span><span style="color: #595959;">abort on errors</span>
<span style="color: #8f0075;">set</span> -e

<span style="color: #595959;"># </span><span style="color: #595959;">install &#26356;&#26032;&#20381;&#36182;</span>
yarn

<span style="color: #595959;"># </span><span style="color: #595959;">build &#26500;&#24314;</span>
yarn build

<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"Build finish!"</span>

<span style="color: #595959;"># </span><span style="color: #595959;">navigate into the build output directory</span>
<span style="color: #8f0075;">cd</span> dist/

<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"tar start"</span>

<span style="color: #595959;"># </span><span style="color: #595959;">&#25171;&#21253;&#21387;&#32553;&#26500;&#24314;&#21518;&#30340;&#38745;&#24577;&#25991;&#20214;</span>
tar zcvf build.tar.gz *

<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">"tar finish"</span>

<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">'upload to 1.1.1.1 and untar'</span>

<span style="color: #595959;"># </span><span style="color: #595959;">&#19978;&#20256;tar&#21253;&#21040;&#30446;&#26631;&#26426;&#22120;&#65292;&#24182;&#35299;&#21387;&#21040;&#23545;&#24212;&#30340;&#30446;&#24405;</span>
ssh root@1.1.1.1 <span style="color: #3548cf;">"tar -C /home/hello-world -xz -f-"</span> &lt; build.tar.gz

<span style="color: #8f0075;">echo</span> <span style="color: #3548cf;">'upload &amp; untar done'</span>

<span style="color: #8f0075;">cd</span> -
</pre>
</div>

<p>
关于 Bash 脚本怎么写，可以看看 <a href="https://wangdoc.com/bash/">Bash 脚本教程</a>， 这里解释一下其中的某行脚本：
</p>

<div class="org-src-container">
<pre class="src src-bash">ssh root@1.1.1.1 <span style="color: #3548cf;">"tar -C /home/hello-world -xz -f-"</span> &lt; build.tar.gz
</pre>
</div>

<ul class="org-ul">
<li><code>ssh root@1.1.1.1</code> 连接机器</li>
<li><code>"tar -C /home/hello-world -xz -f-"</code> 连接机器后执行 tar 解压
<ul class="org-ul">
<li><code>-C</code> 指定解压到什么目录</li>
<li><code>-xz</code> 执行解压</li>
<li><code>-f</code> 指定解压的tar包</li>
<li><code>-</code> 从标准输入中读取， 即读取 <code>build.tar.gz</code></li>
</ul></li>
<li><code>&lt; build.tar.gz</code> 作为tar命令的输入</li>
</ul>
</div>
</div>
<div id="outline-container-org1c19f78" class="outline-2">
<h2 id="org1c19f78">进一步节省操作</h2>
<div class="outline-text-2" id="text-org1c19f78">
<p>
尽管写了 bash 脚本，简单的执行一下就能完成部署了，但每次还要手动执行一下。
</p>

<p>
能不能每次提交时执行呢？使用一些CI工具就可以实现了，例如<a href="https://docs.github.com/en/actions"> GitHub Actions</a>， <a href="https://www.travis-ci.com/">Travis CI</a> 等。
</p>

<p>
笔者使用 <code>GitHub Actions</code> 实现了博客的自动部署，也许可以给你一些<a href="https://spike-leung.github.io/blog/others/deploy-blog-with-github-actions.html">参考</a>。
</p>

<p>
此处不做展开，读者可自行探索 :)
</p>
</div>
</div>
<div id="outline-container-orge5fc8fd" class="outline-2">
<h2 id="orge5fc8fd">参考链接</h2>
<div class="outline-text-2" id="text-orge5fc8fd">
<ul class="org-ul">
<li><a href="https://wangdoc.com/ssh/index.html">ssh 教程</a></li>
<li><a href="https://wangdoc.com/bash/">Bash 脚本教程</a></li>
<li><a href="https://effective-shell.com/">Effective Shell</a></li>
<li><a href="https://www.thegeekdiary.com/how-to-avoid-ssh-from-prompting-key-passphrase-for-passwordless-logins/">How to avoid ssh from prompting key passphrase for passwordless logins</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: Spike Leung (<a href="mailto:l-yanlei@hotmail.com">l-yanlei@hotmail.com</a>)</p>
<p class="date">Date: 2021-08-15T12:44:12+08:00</p>
</div>
</body>
</html>
